/**
 * N 개의 도시가 있다. 각 도시에 메시지를 보내기 위해서는 해당 구간에 통로가 설치되어야 한다.
 * 통로는 일방향이며, 해당 통로를 통해 메시지를 전달할 경우 일정 시간이 소요된다.
 * A라는 도시에서 메시지를 보낼경우 최대한 많은 도시로 메시지를 보내고자 할 때,
 * 메시지를 받을 수 있는 최대 도시의 개수와 모두 메시지를 받는 데까지 걸리는 시간은 얼마인가?
 * 
 * - 입력조건
 * 1. 첫째 줄에 도시의 개수N, 통로의 개수 M 메시지를 보내는 도시 A가 주어진다 (1 <= N <= 30,000 | 1 <= M <= 200,000 | 1 <= A <= N)
 * 2. 둘째 줄부터 M + 1 번째 줄에 걸쳐서 통로에 대한 정보 X, Y, Z가 주어진다. 이는 특정 도시 X에서 다른 도시 Y로 이어지는 통로가 있으며, 전달되는 시간 Z를 의미한다.
 * 
 * - 출력조건
 * 1. 첫째 줄에 도시 A에서 보낸 메시지를 받는 도시의 총 개수와 총 걸리는 시간을 공백으로 구분하여 출력한다.
 */

public class BroadCastMessageTest {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
